#+TAGS: shell sh bash scripting shell_script


*** Parameters
#+BEGIN_SRC sh
#!/bin/bash
#: Title	: Hello You
#: Date		: 2010-01-04
#: Author	: "Alick Mitchell" <mitchell@gmail.com>
#: Version	: 1.0
#: Desription	: "Say hello to you"
#: Options	: one positional input

printf "Hello, %s!\n" "$1"
#+END_SRC
- The limit is 9, 10 is interpreted as the first arg
- To access positionals greater than 9 you must use ${10}, braces
  
- Special Parameters
  - $$ - the current pid
  - $? - the exit code of the last-executed command
  - $_ - the last arg of the command
  - $! - the pid of the last command run in the bkground
  - $- - 

- setting spaces around formated string
#+BEGIN_SRC sh
#!/bin/bash
#: Title	: Hello You
#: Date		: 2010-01-04
#: Author	: "Alick Mitchell" <mitchell@gmail.com>
#: Version	: 1.0
#: Desription	: "Say hello to you"
#: Options	: one positional input

printf "%12.4s %04.2f\n" Jack 1200.333 Jackson 44444.232323 Walter 54.675
#+END_SRC

#+RESULTS:
| Jack |  1200.33 |
| Jack | 44444.23 |
| Walt |    54.67 |

